Revit 2027 API
FabricationServiceButton.GetConditionName Method
 Gets the name of the specified condition on the fabrication service button.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetConditionName(
	int condition
)
Public Function GetConditionName (
	condition As Integer
) As String
public:
String^ GetConditionName(
	int condition
)
member GetConditionName :
        condition : int -> string
Parameters
condition Int32
 The condition index.
Return Value
String
 The name of the specified condition on the fabrication service button.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The index condition is not larger or equal to 0 and less than ConditionCount.
See Also
Reference
FabricationServiceButton Class
Autodesk.Revit.DB Namespace